var app = angular.module("app", []);

app.controller('LanguageCtrl', ['$scope', function LanguageController($scope) {
  $scope.language = texts.uan;
  $scope.setLanguage = function (language) {
    $scope.language = texts[language];
  };
}]);

var texts = {
  rus: {
    about: "Каждый из нас имеет мечты. Мечты к которым мы движемся семимильными или сантиметровыми шагами, несмотря ни на что. Мы верим что дорога к светлому будущему лежит сквозь наши общие усилия. И как бы это пафосно не звучало, но это правда и мы зделаем это!",
    first_step: "Сделайте первый шаг! Расскажите нам про вашу мечту за чашкой ароматного кофе",
    second_step: "Вместе делаем технический план и согласовываем его",
    third_step: "Во время работы мы активно общаемся и делимся результатами",
    fourth_step: "Проект делаем вовремя и готовы сопровождать его",
    dream_team: "Команда мечтателей, которые хотят помочь Вам",
    web_tech: "Рaзроботка мощных WEB приложений з использованием современных фреймворков: AngularJS, BackboneJS, Ruby on Rails",
    mobile_tech: "Мы поддерживаем весь стек разработки под мобильные платформы",
    desktop_tech: "Хотим иметь опыт в розработке настольных програм",
    one_day: "Однажды мы будем иметь достаточно опыта и ресурсов чтобы работать только на свои мечты."
  },
  uan: {
    about: "У кожного із нас є мрії. Мрії до яких ми рухаємося семимильними або сантиметровими кроками, але рухаємося. Ми віримо що шлях до світлого майбутнього пролягає лише через наші спільні зусилля. І як би це пафонсо не звучало, але це правда і разом ми зробимо це!",
    first_step: "Зробіть перший крок! Розкажіть нам про вашу мрію за чашкою запашної кави",
    second_step: "Ваше бачення ідеї ми втілюємо в технічному плані, який разом узгоджуємо",
    third_step: "Під час роботи ативно спілкуємося і ділимося результатами",
    fourth_step: "Реліз проекту в зазначений час і при потребі його підтримка",
    dream_team: "Команда мрійників, які хочуть допомогти Вам",
    web_tech: "Розробка потужних WEB застосунків з використанням сучасних фреймворків: AngularJS, BackboneJS, Ruby on Rails",
    mobile_tech: "Ми підримуємо весь стек розробки під мобільні платформи",
    desktop_tech: "Хочемо мати досвід у створенні настільного програмного забезпечення",
    one_day: "Одного дня ми будемо мати достатньо досвіду і ресурсів щоб працювати лише на свої мрії."
  }
};